Repository: Chisk/MCLauncher.NET
Catalog: MCLauncher.net/Properties/Resources.*.resx
Languages: fi

# addedfiles
source: Added {0} files!
fi: Lisättiin {0} tiedostoa!

source: Added these files
fi: Lisättiin nämä tiedostot

source: Adding...
fi: Lisätään...

source: Bytes
fi: Bittiä

source: Cancelled!
fi: Peruutettu!

# cantconnectmcnet
source: Can't connect to minecraft.net
fi: Minecraft.netiin ei saada yhteyttä

source: Checking MCBans...
fi: Tarkistetaan MCBansiä...

# couldnotreadjar
source: Could not read the Jar!
fi: Virhe Jaria luettaessa!

# couldnotsavenotes
source: Could not save notes. Error:
fi: Virhe lisätietojen tallennuksessa. Virhe:

# dlfinished
source: Download Finished
fi: Lataus valmis

# dlmanclose
source: You have still downloads going. Closing this window will cancel them all!
fi: Latauksia on vielä kesken. Sulkeminen peruuttaa ne kaikki!

# dlmanclosetitle
source: Do you want to close the Download Manager?
fi: Haluatko varmasti sulkea lataustenhallinnan?

# dlstarting
source: Download Starting
fi: Latausta aloitetaan

# dlstopped
source: Download Stopped
fi: Lataus pysäytetty

source: Done!
fi: Valmis!

# downloadedoutof
source: Downloaded {0} out of {1} ({2}%)
fi: Ladattu {0} / {1} ({2}%)

# dragfileshere
source: Drag and Drop files here
fi: Vedä ja pudota tiedostot tähän

source: Error
fi: Virhe

source: Error while saving notes
fi: Virhe lisätietoja tallennettaessa

source: GB
fi: Gt

source: Jar not found!
fi: Jaria ei löytynyt!

# jarnotfoundat
source: Jar was not found at {0}. Please check if the file exists.
fi: Jaria ei löytynyt kohteesta {0}. Tarkista, että tiedosto on olemassa.

source: Java not found
fi: Javaa ei löytynyt

# javanotfounddesc
source: Java was not found on this computer. You need Java to run Minecraft. If you do not have Java, you can download it from http://java.com/ \nIf you do have Java, please click Yes and select it.
fi: Tietokoneeltasi ei löytynyt Javaa. Tarvitset Javan pelataksesi Minecraftia. Jos sinulla ei ole Javaa, voit ladata sen osoitteesta http://java.com/ \nJos sinulla on Java, Paina Kyllä ja valitse se.

source: KB
fi: Kt

source: Logging in...
fi: Kirjaudutaan...

source: Login Failed
fi: Kirjautuminen epäonnistui

source: MB
fi: Mt

# outdatedlauncher
source: Outdated launcher, contact jessenic at digiex.net
fi: Vanhentunut käynnistin, ota yhteyttä jesseniciin digiex.netissä

source: Processing login...
fi: Valmistellaan kirjautumista

source: Processing MCBans...
fi: Valmistellaan MCBansiä

# removedfile
source: Removed {0}
fi: Poistettiin {0}

# showingmainframe
source: Showing the Main Frame...
fi: Näytetään pääruutua

# startdl
source: Start Download
fi: Aloita lataus

source: Stop
fi: Keskeytä

# toolowrep
source: You have too low ban rep! Check MCBans.com!
fi: Sinulla on liikaa porttikieltoja! Katso mcbans.com!

# langwillchangeinfo
source: You need to reopen the launcher to change the language.
fi: Sovellus on käynnistettävä uudelleen ennen kuin uudet kieliasetukset astuvat voimaan.

# langwillchangetitle
source: Application restart needed
fi: Sovelluksen uudelleenkäynnistys vaaditaan
